 # Big Data Engineering with Python
 `by คอลิด ลังสารี Kholed Langsari`

# Setup

All the database tables in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design

In [ ]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-star.sql

## Connect to the local database where Pagila is loaded

In [2]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'admin'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

postgresql://postgres:admin@127.0.0.1:5432/pagila

/Users/kholed/anaconda3/lib/python3.7/site-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

## Verify Pagila-Start Schema

In [13]:
%%sql
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';

 * postgresql://postgres:***@127.0.0.1:5432/pagila
27 rows affected.

[('public', 'payment', 'postgres', None, True, False, False, False),
 ('public', 'film', 'postgres', None, True, False, True, False),
 ('public', 'actor', 'postgres', None, True, False, True, False),
 ('public', 'address', 'postgres', None, True, False, True, False),
 ('public', 'category', 'postgres', None, True, False, True, False),
 ('public', 'city', 'postgres', None, True, False, True, False),
 ('public', 'country', 'postgres', None, True, False, True, False),
 ('public', 'customer', 'postgres', None, True, False, True, False),
 ('public', 'film_actor', 'postgres', None, True, False, True, False),
 ('public', 'film_category', 'postgres', None, True, False, True, False),
 ('public', 'inventory', 'postgres', None, True, False, True, False),
 ('public', 'language', 'postgres', None, True, False, True, False),
 ('public', 'rental', 'postgres', None, True, False, True, False),
 ('public', 'staff', 'postgres', None, True, False, True, False),
 ('public', 'store', 'postgres', None, True, False, True, False),
 ('public', 'payment_p2020_01', 'postgres', None, True, False, True, False),
 ('public', 'payment_p2020_02', 'postgres', None, True, False, True, False),
 ('public', 'payment_p2020_03', 'postgres', None, True, False, True, False),
 ('public', 'payment_p2020_04', 'postgres', None, True, False, True, False),
 ('public', 'payment_p2020_05', 'postgres', None, True, False, True, False),
 ('public', 'payment_p2020_06', 'postgres', None, True, False, True, False),
 ('public', 'test_table', 'postgres', None, False, False, False, False),
 ('public', 'dimdate', 'postgres', None, True, False, True, False),
 ('public', 'factsales', 'postgres', None, True, False, True, False),
 ('public', 'dimcustomer', 'postgres', None, True, False, True, False),
 ('public', 'dimmovie', 'postgres', None, True, False, True, False),
 ('public', 'dimstore', 'postgres', None, True, False, True, False)]

# OLAP Cubes 1 - Slicing and Dicing

## Star Schema

<img src="images/pagila-star.png" width="50%"/>

## Start with a simple cube
TODO: Write a query that calculates the revenue (sales_amount) by day, rating, and city. Remember to join with the appropriate dimension tables to replace the keys with the dimension labels. Sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [4]:
%%time
%%sql

SELECT t.day, m.rating, s.city, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY t.day, m.rating, s.city
ORDER BY  revenue desc
LIMIT 10

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 5.18 ms, sys: 1.96 ms, total: 7.14 ms
Wall time: 8.05 ms

[(30, 'G', 'Lethbridge', Decimal('31.95')),
 (21, 'PG-13', 'Lethbridge', Decimal('23.95')),
 (20, 'PG-13', 'Lethbridge', Decimal('22.95')),
 (18, 'PG', 'Woodridge', Decimal('19.97')),
 (1, 'R', 'Lethbridge', Decimal('19.96')),
 (8, 'G', 'Lethbridge', Decimal('19.95')),
 (18, 'R', 'Woodridge', Decimal('18.97')),
 (30, 'PG-13', 'Lethbridge', Decimal('18.95')),
 (18, 'G', 'Lethbridge', Decimal('16.98')),
 (19, 'PG', 'Lethbridge', Decimal('15.97'))]

## Slicing

Slicing is the reduction of the dimensionality of a cube by 1 e.g. 3 dimensions to 2, fixing one of the dimensions to a single value. In the example above, we have a 3-dimensional cube on day, rating, and country.

TODO: Write a query that reduces the dimensionality of the above example by limiting the results to only include movies with a `rating` of "PG-13". Again, sort by revenue in descending order and limit to the first 20 rows. The first few rows of your output should match the table below.

In [6]:
%%time
%%sql

SELECT t.day, m.rating, s.city, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
WHERE m.rating = 'PG-13'
GROUP BY t.day, m.rating, s.city
ORDER BY  revenue desc
LIMIT 10

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.
CPU times: user 5.22 ms, sys: 1.39 ms, total: 6.61 ms
Wall time: 6.88 ms

[(21, 'PG-13', 'Lethbridge', Decimal('23.95')),
 (20, 'PG-13', 'Lethbridge', Decimal('22.95')),
 (30, 'PG-13', 'Lethbridge', Decimal('18.95')),
 (19, 'PG-13', 'Lethbridge', Decimal('14.97')),
 (23, 'PG-13', 'Lethbridge', Decimal('12.97')),
 (30, 'PG-13', 'Woodridge', Decimal('11.97')),
 (28, 'PG-13', 'Lethbridge', Decimal('10.98')),
 (12, 'PG-13', 'Lethbridge', Decimal('10.98')),
 (8, 'PG-13', 'Woodridge', Decimal('9.99')),
 (16, 'PG-13', 'Woodridge', Decimal('9.98'))]

## Dicing
Dicing is creating a subcube with the same dimensionality but fewer values for  two or more dimensions. 

TODO: Write a query to create a subcube of the initial cube that includes moves with:
* ratings of PG or PG-13
* in the city of Bellevue or Lancaster
* day equal to 1, 15, or 30

The first few rows of your output should match the table below.

In [7]:
%%time
%%sql

SELECT t.day, m.rating, s.city, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
WHERE m.rating in ('PG-13', 'PG') 
AND s.city in ('Lethbridge', 'Woodridge') 
AND t.day in ('1', '15', '30')
GROUP BY t.day, m.rating, s.city
ORDER BY  revenue desc
LIMIT 20

 * postgresql://postgres:***@127.0.0.1:5432/pagila
9 rows affected.
CPU times: user 6.04 ms, sys: 2.09 ms, total: 8.13 ms
Wall time: 19.2 ms

[(30, 'PG-13', 'Lethbridge', Decimal('18.95')),
 (30, 'PG', 'Lethbridge', Decimal('14.97')),
 (30, 'PG-13', 'Woodridge', Decimal('11.97')),
 (1, 'PG-13', 'Lethbridge', Decimal('7.98')),
 (15, 'PG-13', 'Woodridge', Decimal('6.99')),
 (15, 'PG-13', 'Lethbridge', Decimal('4.99')),
 (15, 'PG', 'Woodridge', Decimal('2.99')),
 (15, 'PG', 'Lethbridge', Decimal('0.99')),
 (1, 'PG-13', 'Woodridge', Decimal('0.99'))]

Congratulations you have done slicing and dicing

# OLAP Cubes 2 - Roll Up and Drill Down

## Roll-up
- Stepping up the level of aggregation to a large grouping
- e.g.`city` is summed as `country`

TODO: Write a query that calculates revenue (sales_amount) by day, rating, and country. Sort the data by revenue in descending order, and limit the data to the top 20 results. The first few rows of your output should match the table below.

In [9]:
%%time
%%sql
SELECT t.day, m.rating, s.country, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY t.day, m.rating, s.country
ORDER BY  revenue desc
LIMIT 20

 * postgresql://postgres:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 6.33 ms, sys: 2.37 ms, total: 8.7 ms
Wall time: 9.4 ms

[(30, 'G', 'Canada', Decimal('31.95')),
 (21, 'PG-13', 'Canada', Decimal('23.95')),
 (20, 'PG-13', 'Canada', Decimal('22.95')),
 (18, 'PG', 'Australia', Decimal('19.97')),
 (1, 'R', 'Canada', Decimal('19.96')),
 (8, 'G', 'Canada', Decimal('19.95')),
 (18, 'R', 'Australia', Decimal('18.97')),
 (30, 'PG-13', 'Canada', Decimal('18.95')),
 (18, 'G', 'Canada', Decimal('16.98')),
 (19, 'PG', 'Canada', Decimal('15.97')),
 (17, 'R', 'Canada', Decimal('15.95')),
 (19, 'PG-13', 'Canada', Decimal('14.97')),
 (30, 'PG', 'Canada', Decimal('14.97')),
 (27, 'PG', 'Australia', Decimal('14.96')),
 (18, 'NC-17', 'Australia', Decimal('13.98')),
 (17, 'PG', 'Canada', Decimal('13.98')),
 (22, 'NC-17', 'Australia', Decimal('13.98')),
 (27, 'PG', 'Canada', Decimal('13.97')),
 (17, 'NC-17', 'Canada', Decimal('13.96')),
 (10, 'PG', 'Canada', Decimal('13.96'))]

## Drill-down
- Breaking up one of the dimensions to a lower level.
- e.g.`city` is broken up into  `districts`

TODO: Write a query that calculates revenue (sales_amount) by day, rating, and district. Sort the data by revenue in descending order, and limit the data to the top 20 results. The first few rows of your output should match the table below.

In [10]:
%%time
%%sql
SELECT t.day, m.rating, s.district, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimmovie m ON (f.movie_key = m.movie_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY t.day, m.rating,  s.district
ORDER BY  revenue desc
LIMIT 20

 * postgresql://postgres:***@127.0.0.1:5432/pagila
20 rows affected.
CPU times: user 6.52 ms, sys: 1.6 ms, total: 8.11 ms
Wall time: 8.89 ms

[(30, 'G', 'Alberta', Decimal('31.95')),
 (21, 'PG-13', 'Alberta', Decimal('23.95')),
 (20, 'PG-13', 'Alberta', Decimal('22.95')),
 (18, 'PG', 'QLD', Decimal('19.97')),
 (1, 'R', 'Alberta', Decimal('19.96')),
 (8, 'G', 'Alberta', Decimal('19.95')),
 (18, 'R', 'QLD', Decimal('18.97')),
 (30, 'PG-13', 'Alberta', Decimal('18.95')),
 (18, 'G', 'Alberta', Decimal('16.98')),
 (19, 'PG', 'Alberta', Decimal('15.97')),
 (17, 'R', 'Alberta', Decimal('15.95')),
 (30, 'PG', 'Alberta', Decimal('14.97')),
 (19, 'PG-13', 'Alberta', Decimal('14.97')),
 (27, 'PG', 'QLD', Decimal('14.96')),
 (22, 'NC-17', 'QLD', Decimal('13.98')),
 (18, 'NC-17', 'QLD', Decimal('13.98')),
 (17, 'PG', 'Alberta', Decimal('13.98')),
 (27, 'PG', 'Alberta', Decimal('13.97')),
 (23, 'PG', 'Alberta', Decimal('13.96')),
 (10, 'PG', 'Alberta', Decimal('13.96'))]

Congratulation you have done roll-up and drill-down

# OLAP Cubes 3 - Grouping Sets

## Grouping Sets
- It happens often that for 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

## Total Revenue

TODO: Write a query that calculates total revenue (sales_amount)

In [11]:
%%sql
SELECT sum(f.sales_amount) as revenue
FROM factsales f

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(Decimal('1173.20'),)]

## Revenue by Country
TODO: Write a query that calculates total revenue (sales_amount) by country

In [12]:
%%sql
SELECT s.country, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY s.country
ORDER BY  revenue desc
LIMIT 20

 * postgresql://postgres:***@127.0.0.1:5432/pagila
2 rows affected.

[('Canada', Decimal('707.27')), ('Australia', Decimal('465.93'))]

## Revenue by Month
TODO: Write a query that calculates total revenue (sales_amount) by month

In [13]:
%%sql
SELECT t.month, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
GROUP BY  t.month
ORDER BY  revenue desc
LIMIT 20

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(4, Decimal('492.87')),
 (3, Decimal('403.07')),
 (2, Decimal('195.48')),
 (1, Decimal('68.84')),
 (5, Decimal('12.94'))]

## Revenue by Month & Country
TODO: Write a query that calculates total revenue (sales_amount) by month and country. Sort the data by month, country, and revenue in descending order. The first few rows of your output should match the table below.

In [15]:
%%sql
SELECT t.month, s.country, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY t.month, s.country
ORDER BY  revenue desc
LIMIT 10

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(4, 'Canada', Decimal('284.31')),
 (3, 'Canada', Decimal('273.35')),
 (4, 'Australia', Decimal('208.56')),
 (3, 'Australia', Decimal('129.72')),
 (2, 'Australia', Decimal('100.72')),
 (2, 'Canada', Decimal('94.76')),
 (1, 'Canada', Decimal('44.88')),
 (1, 'Australia', Decimal('23.96')),
 (5, 'Canada', Decimal('9.97')),
 (5, 'Australia', Decimal('2.97'))]

## Revenue Total, by Month, by Country, by Month & Country All in one shot

TODO: Write a query that calculates total revenue at the various grouping levels done above (total, by month, by country, by month & country) all at once using the grouping sets function. Your output should match the table below.

In [16]:
%%sql
SELECT t.month, s.country, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY GROUPING SETS (
    (),
    t.month,
    s.country,
    (t.month, s.country)
)
LIMIT 10;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
10 rows affected.

[(None, None, Decimal('1173.20')),
 (5, 'Canada', Decimal('9.97')),
 (3, 'Australia', Decimal('129.72')),
 (3, 'Canada', Decimal('273.35')),
 (4, 'Canada', Decimal('284.31')),
 (1, 'Canada', Decimal('44.88')),
 (2, 'Australia', Decimal('100.72')),
 (5, 'Australia', Decimal('2.97')),
 (2, 'Canada', Decimal('94.76')),
 (1, 'Australia', Decimal('23.96'))]

Congratulation you have done grouping sets

# OLAP Cubes 4 - CUBE

## CUBE 
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lenghts in one go.
- This view could be materialized in a view and queried which would save lots repetitive aggregations

TODO: Write a query that calculates the various levels of aggregation done in the grouping sets exercise (total, by month, by country, by month & country) using the CUBE function. Your output should match the table below.

In [17]:
%%time
%%sql
SELECT t.month, s.country, sum(f.sales_amount) as revenue
FROM factsales f 
JOIN dimdate t ON (f.date_key = t.date_key)
JOIN dimstore s ON (f.store_key = s.store_key)
GROUP BY CUBE (t.month, s.country)
LIMIT 20

 * postgresql://postgres:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 4.89 ms, sys: 1.5 ms, total: 6.39 ms
Wall time: 6.48 ms

[(None, None, Decimal('1173.20')),
 (5, 'Canada', Decimal('9.97')),
 (3, 'Australia', Decimal('129.72')),
 (3, 'Canada', Decimal('273.35')),
 (4, 'Canada', Decimal('284.31')),
 (1, 'Canada', Decimal('44.88')),
 (2, 'Australia', Decimal('100.72')),
 (5, 'Australia', Decimal('2.97')),
 (2, 'Canada', Decimal('94.76')),
 (1, 'Australia', Decimal('23.96')),
 (4, 'Australia', Decimal('208.56')),
 (3, None, Decimal('403.07')),
 (5, None, Decimal('12.94')),
 (4, None, Decimal('492.87')),
 (2, None, Decimal('195.48')),
 (1, None, Decimal('68.84')),
 (None, 'Canada', Decimal('707.27')),
 (None, 'Australia', Decimal('465.93'))]

## Revenue Total, by Month, by Country, by Month & Country All in one shot, NAIVE way
The naive way to create the same table as above is to write several queries and UNION them together. Grouping sets and cubes produce queries that are shorter to write, easier to read, and more performant. Run the naive query below and compare the time it takes to run to the time it takes the cube query to run.

In [18]:
%%time
%%sql
SELECT  NULL as month, NULL as country, sum(sales_amount) as revenue
FROM factSales
    UNION all 
SELECT NULL, dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by  dimStore.country
    UNION all 
SELECT cast(dimDate.month as text) , NULL, sum(sales_amount) as revenue
FROM factSales
JOIN dimDate on (dimDate.date_key = factSales.date_key)
GROUP by dimDate.month
    UNION all
SELECT cast(dimDate.month as text),dimStore.country,sum(sales_amount) as revenue
FROM factSales
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimStore on (dimStore.store_key = factSales.store_key)
GROUP by (dimDate.month, dimStore.country)

 * postgresql://postgres:***@127.0.0.1:5432/pagila
18 rows affected.
CPU times: user 8.57 ms, sys: 2.57 ms, total: 11.1 ms
Wall time: 13.2 ms

[(None, None, Decimal('1173.20')),
 (None, 'Canada', Decimal('707.27')),
 (None, 'Australia', Decimal('465.93')),
 ('3', None, Decimal('403.07')),
 ('5', None, Decimal('12.94')),
 ('4', None, Decimal('492.87')),
 ('2', None, Decimal('195.48')),
 ('1', None, Decimal('68.84')),
 ('5', 'Canada', Decimal('9.97')),
 ('3', 'Australia', Decimal('129.72')),
 ('3', 'Canada', Decimal('273.35')),
 ('4', 'Canada', Decimal('284.31')),
 ('1', 'Canada', Decimal('44.88')),
 ('2', 'Australia', Decimal('100.72')),
 ('5', 'Australia', Decimal('2.97')),
 ('2', 'Canada', Decimal('94.76')),
 ('1', 'Australia', Decimal('23.96')),
 ('4', 'Australia', Decimal('208.56'))]

Congratulation you have done cube

# More Advance Topic: 
## Columnar Vs Row Storage

- The columnar storage extension used here: 
- cstore_fdw by citus_data [https://github.com/citusdata/cstore_fdw](https://github.com/citusdata/cstore_fdw)
- The data tables are the ones used by citus_data to show the storage extension